// Task 2. Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
// В условиях задачи нет указания на какие должны быть числа, поэтому сделал их целыми.

/*Console.WriteLine("Hello, write the first integer number ");
int number1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Write the second integer number ");
int number2 = Convert.ToInt32(Console.ReadLine());
int max = number1;
if(number2 > max)
{
    Console.WriteLine("The largest number " + number2);
}
else
{
    Console.WriteLine("The largest number " + number1);
}
Console.WriteLine("Thank you");
*/

// Task 4. Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел
// В условиях задачи нет указания на какие должны быть числа, поэтому сделал их дробными.

/*Console.WriteLine("Hello, what is your name ?");
string name = Console.ReadLine();
Console.WriteLine(name + " Write the first fractional number ");
double number1 = Convert.ToDouble(Console.ReadLine());
Console.WriteLine(name + " Write the second fractional number ");
double number2 = Convert.ToDouble(Console.ReadLine());
Console.WriteLine(name + " Write the third fractional number ");
double number3 = Convert.ToDouble(Console.ReadLine());
Console.Clear();
double max = number1;
if(number2 > max)
{
    max = number2;
    if(number3 > max)
    {
        Console.WriteLine("The largest number " + number3);
    }
    else
    {
        Console.WriteLine("The largest number " + number2);
    }
    
}
else 
{
    max = number1;
    if(number3 > max)
    {
        Console.WriteLine("The largest number " + number3);
    }
    else
    {
        Console.WriteLine("The largest number " + number1);
    }
}
Console.Write("Thank you " + name);
*/

// Task 6. Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
// В условиях задачи нет указания на какие должны быть числа, поэтому сделал их целыми.
/*
Console.WriteLine("Hello, what you name ?");
string name = Console.ReadLine();
Console.Clear();
Console.WriteLine(name + " Write number ");
int number = Convert.ToInt32(Console.ReadLine());
Console.Clear();
if (number % 2 == 0)
{
    Console.WriteLine(number + " is an even number");
}
else
{
    Console.WriteLine(number + " odd number");
}
Console.Write("Thank you " + name + " , bye bye!!!");
*/